<?php

/**
 * @var $this   SprintEditorBlocksComponent
 * @var $layout array
 *
 * Если сетка состоит из 1 колонки без оформления, выводим простой список блоков
 * Иначе выводим нормальный шаблон сетки
 * Переделайте этот шаблон на свое усмотрение
 * 
 * не обрабатываем оформление колонок, просто выводим блоки (игнорируется настройка свойства Пользовательские настройки блоков)
 */
foreach ($layout['columns'] as $column) {
    foreach ($column['blocks'] as $block) {
        $this->includeBlock($block);
    }
}
